package code00000010;

public class java80_0005_groupProject_accountInfo {

    public static void main(String[] args) {
        //VIP회원정보를 관리하는 시스템을 구축하려고 합니다
        //1) 초기 메뉴는 1. 회원가입(현재회원은 ?/3명) 2. 로그인 3. 관리자메뉴 가 있습니다
        // 회원가입을 누른 뒤 3명의 회원이 가입되어 있으면,
        // "회원이 모두 가입되어 있습니다. 초기화면으로 돌아갑니다" 출력이 되고
        // 초기메뉴로 돌아갑니다
        //2) 3명의 미만의 회원이 가입되어 있으면 "계정을 입력하시오"가 출력되고
        // 동일한 계정ID가 있는지 확인합니다
        //3)
        //?) 0. 관리자 메뉴에 접속하면 설정된 비밀번호와 동일한지 확인합니다
        //비밀번호가 동일하면 회원ID가 모두 출력이 됩니다
        //특정 회원 ID를 입력하면 삭제가 되고, 현재 가입된 회원 목록이 출력됩니다
    }
}
